class PairsDataFormal:
    VOWEL_PAIRS = [
        ('අ', 'a'),
        ('ආ', 'ā'),
        ('ඇ', 'æ'),
        ('ඈ', 'ǣ'),
        ('ඉ', 'i'),
        ('ඊ', 'ī'),
        ('උ', 'u'),
        ('ඌ', 'ū'),
        #
        ('එ', 'e'),
        ('ඒ', 'ē'),
        ('ඓ', 'ai'),
        ('ඔ', 'o'),
        ('ඕ', 'ō'),
        ('ඖ', 'au'),
        #
        ('අං', 'ang'),
        ('අඃ', 'ak'),
    ]
    CONSONANTS_PAIRS = [
        ('ක', 'k'),
        ('ඛ', 'kh'),
        ('ග', 'g'),
        ('ඝ', 'gh'),
        ('ඞ', 'ṅ'),
        ('ඟ', 'ňg'),
        #
        ('ච', 'c'),
        ('ඡ', 'ch'),
        ('ජ', 'j'),
        ('ඣ', 'jh'),
        ('ඤ', 'ñ'),
        ('ඥ', 'jhn'),
        ('ඦ', 'ňj'),
        #
        ('ට', 'ṭ'),
        ('ඨ', 'ṭh'),
        ('ඩ', 'ḍ'),
        ('ඪ', 'ḍh'),
        ('ණ', 'ṇ'),
        ('ඬ', 'ňḍ'),
        #
        ('ත', 't'),
        ('ථ', 'th'),
        ('ද', 'd'),
        ('ධ', 'dh'),
        ('න', 'n'),
        ('ඳ', 'ňd'),
        #
        ('ප', 'p'),
        ('ඵ', 'ph'),
        ('බ', 'b'),
        ('භ', 'bh'),
        ('ම', 'm'),
        ('ඹ', '◌̌mb'),
        #
        ('ය', 'y'),
        ('ර', 'r'),
        ('ල', 'l'),
        ('ව', 'v'),
        ('ශ', '◌́s'),
        ('ෂ', 'ṣ'),
        ('ස', 's'),
        ('හ', 'h'),
        ('ළ', 'ḷ'),
        ('ෆ', 'f'),
        # conjunct/complex
        ('ක්‍ර', 'kr'),
        ('ක්‍ව', 'kv'),
        ('ක්‍ව', 'kw'),
        ('ක්‍ෂ', 'kṣ'),
        ('ඛ්‍ය', 'khy'),
        ('ජ්‍ය', 'jy'),
        ('ත්‍ය', 'ty'),
        ('ත්‍ර', 'tr'),
        ('ද්‍ය', 'dy'),
        ('ද්‍ර', 'dr'),
        ('න්‍ය', 'ny'),
        ('ප්‍ර', 'pr'),
        ('ම්‍ය', 'my'),
        ('ව්‍ය', 'vy'),
        ('ශ්‍ර', '◌́sr'),
    ]

    DIACRITIC_PAIRS = [
        #
        ('්', '-'),
        ('ා', 'ā'),
        ('ැ', 'æ'),
        ('ෑ', 'ǣ'),
        ('ි', 'i'),
        ('ී', 'ī'),
        ('ු', 'u'),
        ('ූ', 'ū'),
        #
        ('ෙ', 'e'),
        ('ේ', 'ē'),
        ('ෛ', 'ai'),
        ('ො', 'o'),
        ('ෝ', 'ō'),
        ('ෞ', 'au'),
        #
        ('ෘ', 'ru'),
        #
        ('ං', 'angg'),
        ('ඃ', 'akk'),
        # HACK
        ('ාං', 'aang'),
        ('ිං', 'ing'),
        ('ෙං', 'eng'),
    ]

    CONSONANTS_PLUS_DIACRITIC_PAIRS = [
        ('ඍ', 'sru'),
        ('කෘ', 'kru'),
        ('කෲ', 'kruu'),
        ('දෟ', 'dru'),
        ('පෘ', 'pru'),
        ('බ්‍රි', 'bri'),
    ]
